# OpeningNegativeHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..OpeningFailures..::..OpeningNegativeHeight Property
BuiltInFailures..::..OpeningFailures Class See Also
---
The top of the Opening is lower than the bottom of the Opening or coincident with it.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId OpeningNegativeHeight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OpeningNegativeHeight As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ OpeningNegativeHeight {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..OpeningFailures Class
Autodesk.Revit.DB Namespace